# Tapping Additional Homebrew Repos
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Installing Homebrew Packages
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'gifsicle'
brew 'git'
brew 'htop'
brew 'libpng'
brew 'node', args: ['with-full-icu']
brew 'openssh'
brew 'python'
brew 'vim', args: ['with-override-system-vi']
brew 'wget', args: ['with-iri']
brew 'yarn'
brew 'zsh'

# Installing Homebrew Casks
cask 'alfred'
cask 'atom'
cask 'ccleaner'
cask 'firefox'
cask 'font-fira-code'
cask 'google-chrome'
cask 'kap'
cask 'postman'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'vlc'
